from colorama import Fore


print(Fore.LIGHTGREEN_EX+"""



                     _       _____      _ _ _     _           
     /\             (_)     / ____|    | | (_)   | |          
    /  \   _ __ ___  _ _ __| |     ___ | | |_  __| | ___ _ __ 
   / /\ \ | '_ ` _ \| | '__| |    / _ \| | | |/ _` |/ _ \ '__|
  / ____ \| | | | | | | |  | |___| (_) | | | | (_| |  __/ |   
 /_/    \_\_| |_| |_|_|_|   \_____\___/|_|_|_|\__,_|\___|_|   


 

                                                                                                                      
                                                                                                                      
                           ,--,                                ,--,                      ___                          
                         ,--.'|                              ,--.'|                    ,--.'|_                        
                         |  | :                        ,--,  |  | :                    |  | :,'     ,---.     __  ,-. 
                         :  : '                      ,'_ /|  :  : '                    :  : ' :    '   ,'\  ,' ,'/ /| 
   ,---.      ,--.--.    |  ' |       ,---.     .--. |  | :  |  ' |       ,--.--.    .;__,'  /    /   /   | '  | |' | 
  /     \    /       \   '  | |      /     \  ,'_ /| :  . |  '  | |      /       \   |  |   |    .   ; ,. : |  |   ,' 
 /    / '   .--.  .-. |  |  | :     /    / '  |  ' | |  . .  |  | :     .--.  .-. |  :__,'| :    '   | |: : '  :  /   
.    ' /     \__\/: . .  '  : |__  .    ' /   |  | ' |  | |  '  : |__    \__\/: . .    '  : |__  '   | .; : |  | '    
'   ; :__    ," .--.; |  |  | '.'| '   ; :__  :  | : ;  ; |  |  | '.'|   ," .--.; |    |  | '.'| |   :    | ;  : |    
'   | '.'|  /  /  ,.  |  ;  :    ; '   | '.'| '  :  `--'   \ ;  :    ;  /  /  ,.  |    ;  :    ;  \   \  /  |  , ;    
|   :    : ;  :   .'   \ |  ,   /  |   :    : :  ,      .-./ |  ,   /  ;  :   .'   \   |  ,   /    `----'    ---'     
 \   \  /  |  ,     .-./  ---`-'    \   \  /   `--`----'      ---`-'   |  ,     .-./    ---`-'                        
  `----'    `--`---'                 `----'                             `--`---'                                      
                                                                                                                      


                                                              
""")

def calculator():
    while True:
        # گرفتن عملیات از کاربر
        print("عملیات را وارد کنید یا 'خروج' برای خروج:")
        operation = input()

        if operation == "خروج":
            print("خدانگهدار!")
            break

        # گرفتن عدد اول
        print("عدد اول را وارد کنید:")
        num1 = float(input())

        # گرفتن عدد دوم
        print("عدد دوم را وارد کنید:")
        num2 = float(input())

        result = None

        # انجام عملیات
        if operation == "+":
            result = num1 + num2
        elif operation == "-":
            result = num1 - num2
        elif operation == "*":
            result = num1 * num2
        elif operation == "/":
            if num2 != 0:
                result = num1 / num2
            else:
                print("خطا: تقسیم بر صفر!")
        else:
            print("عملیات نامعتبر!")

        # نمایش نتیجه
        if result is not None:
            print("نتیجه: " + str(result))
        print("-------------------------------")

# اجرای برنامه
calculator()
